In [23]:
import pandas as pd
sales = pd.read_csv('1500000 Sales Records.csv')

In [24]:
sales.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Sub-Saharan Africa,South Africa,Fruits,Offline,M,7/27/2012,443368995,7/28/2012,1593,9.33,6.92,14862.69,11023.56,3839.13
1,Middle East and North Africa,Morocco,Clothes,Online,M,9/14/2013,667593514,10/19/2013,4611,109.28,35.84,503890.08,165258.24,338631.84
2,Australia and Oceania,Papua New Guinea,Meat,Offline,M,5/15/2015,940995585,6/4/2015,360,421.89,364.69,151880.40,131288.40,20592.00
3,Sub-Saharan Africa,Djibouti,Clothes,Offline,H,5/17/2017,880811536,7/2/2017,562,109.28,35.84,61415.36,20142.08,41273.28
4,Europe,Slovakia,Beverages,Offline,L,10/26/2016,174590194,12/4/2016,3973,47.45,31.79,188518.85,126301.67,62217.18

In [25]:
sales.shape

(1500000, 14)

In [26]:
Order_table = sales[["Order ID", 'Order Priority', 'Sales Channel']]

In [27]:
Order_table

          Order ID Order Priority Sales Channel
0        443368995              M       Offline
1        667593514              M        Online
2        940995585              M       Offline
3        880811536              H       Offline
4        174590194              L       Offline
...            ...            ...           ...
1499995  168976438              H        Online
1499996  458885467              L        Online
1499997  925852906              L       Offline
1499998  385552585              H        Online
1499999  873970830              M        Online

[1500000 rows x 3 columns]

In [28]:
sales['year'] = pd.DatetimeIndex(sales['Order Date']).year
sales['month'] = pd.DatetimeIndex(sales['Order Date']).month
sales['Day'] = pd.DatetimeIndex(sales['Order Date']).day
sales['DayofWeek'] = pd.DatetimeIndex(sales['Order Date']).dayofweek
sales['Dayofyear'] = pd.DatetimeIndex(sales['Order Date']).dayofyear
sales['Week'] = pd.DatetimeIndex(sales['Order Date']).week

In [29]:
sales.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit,year,month,Day,DayofWeek,Dayofyear,Week
0,Sub-Saharan Africa,South Africa,Fruits,Offline,M,7/27/2012,443368995,7/28/2012,1593,9.33,6.92,14862.69,11023.56,3839.13,2012,7,27,4,209,30
1,Middle East and North Africa,Morocco,Clothes,Online,M,9/14/2013,667593514,10/19/2013,4611,109.28,35.84,503890.08,165258.24,338631.84,2013,9,14,5,257,37
2,Australia and Oceania,Papua New Guinea,Meat,Offline,M,5/15/2015,940995585,6/4/2015,360,421.89,364.69,151880.40,131288.40,20592.00,2015,5,15,4,135,20
3,Sub-Saharan Africa,Djibouti,Clothes,Offline,H,5/17/2017,880811536,7/2/2017,562,109.28,35.84,61415.36,20142.08,41273.28,2017,5,17,2,137,20
4,Europe,Slovakia,Beverages,Offline,L,10/26/2016,174590194,12/4/2016,3973,47.45,31.79,188518.85,126301.67,62217.18,2016,10,26,2,300,43

In [30]:
sales.columns

Index(['Region', 'Country', 'Item Type', 'Sales Channel', 'Order Priority',
       'Order Date', 'Order ID', 'Ship Date', 'Units Sold', 'Unit Price',
       'Unit Cost', 'Total Revenue', 'Total Cost', 'Total Profit', 'year',
       'month', 'Day', 'DayofWeek', 'Dayofyear', 'Week'],
      dtype='object')

In [31]:
sales = sales.rename(columns = {"Item Type":"Item_Type","Sales Channel":"Sales_Channel","Order Priority":"Order_Priority","Order Date":"Order_Date","Order ID":"Order_ID","Ship Date":"Ship_Date","Units Sold":"Unit_Sold","Unit Price":"Unit_Price","Unit Cost":"Unit_Cost","Total Revenue":"Total_Revenue","Total Cost":"Total_Cost","Total Profit":"Total_profit"})

In [32]:
import pyodbc as db  # SQL Server
conn = db.connect('Driver={SQL Server};'
                 'Server=DESKTOP-UVT33PM;'
                 'Database=SalesProject;'
                 'Trusted_Connection=yes;')
cursor = conn.cursor()

    INSERTION OF VALUES INTO THE TABLE (ETL)

In [33]:
for i,row in sales.iterrows():
    sales.at[i,"Item_Type"] = row.Item_Type.replace(" ","_")

In [34]:
sales.head()

,Region,Country,Item_Type,Sales_Channel,Order_Priority,Order_Date,Order_ID,Ship_Date,Unit_Sold,Unit_Price,Unit_Cost,Total_Revenue,Total_Cost,Total_profit,year,month,Day,DayofWeek,Dayofyear,Week
0,Sub-Saharan Africa,South Africa,Fruits,Offline,M,7/27/2012,443368995,7/28/2012,1593,9.33,6.92,14862.69,11023.56,3839.13,2012,7,27,4,209,30
1,Middle East and North Africa,Morocco,Clothes,Online,M,9/14/2013,667593514,10/19/2013,4611,109.28,35.84,503890.08,165258.24,338631.84,2013,9,14,5,257,37
2,Australia and Oceania,Papua New Guinea,Meat,Offline,M,5/15/2015,940995585,6/4/2015,360,421.89,364.69,151880.40,131288.40,20592.00,2015,5,15,4,135,20
3,Sub-Saharan Africa,Djibouti,Clothes,Offline,H,5/17/2017,880811536,7/2/2017,562,109.28,35.84,61415.36,20142.08,41273.28,2017,5,17,2,137,20
4,Europe,Slovakia,Beverages,Offline,L,10/26/2016,174590194,12/4/2016,3973,47.45,31.79,188518.85,126301.67,62217.18,2016,10,26,2,300,43

In [35]:
itemdf = sales[['Item_Type','Unit_Price','Unit_Cost']]

In [36]:
itemdf['Item_Type'].unique()

array(['Fruits', 'Clothes', 'Meat', 'Beverages', 'Office_Supplies',
       'Cosmetics', 'Snacks', 'Personal_Care', 'Household', 'Vegetables',
       'Baby_Food', 'Cereal'], dtype=object)

In [37]:
values = {'Id':[1,2,3,4,5,6,7,8,9,10,11,12],
        'Item_Type':['Fruits', 'Clothes', 'Meat', 'Beverages', 'Office_Supplies','Cosmetics', 'Snacks', 'Personal_Care', 'Household', 'Vegetables','Baby_Food', 'Cereal']}

In [38]:
item = pd.DataFrame(data=values)

In [39]:
item

    Id        Item_Type
0    1           Fruits
1    2          Clothes
2    3             Meat
3    4        Beverages
4    5  Office_Supplies
5    6        Cosmetics
6    7           Snacks
7    8    Personal_Care
8    9        Household
9   10       Vegetables
10  11        Baby_Food
11  12           Cereal

In [40]:
result = pd.merge(itemdf,item, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=False,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)
result

        Item_Type  Unit_Price  Unit_Cost  Id
0          Fruits        9.33       6.92   1
1          Fruits        9.33       6.92   1
2          Fruits        9.33       6.92   1
3          Fruits        9.33       6.92   1
4          Fruits        9.33       6.92   1
...           ...         ...        ...  ..
1499995    Cereal      205.70     117.11  12
1499996    Cereal      205.70     117.11  12
1499997    Cereal      205.70     117.11  12
1499998    Cereal      205.70     117.11  12
1499999    Cereal      205.70     117.11  12

[1500000 rows x 4 columns]

In [41]:
itemdf = result.drop_duplicates()
itemdf

               Item_Type  Unit_Price  Unit_Cost  Id
0                 Fruits        9.33       6.92   1
125310           Clothes      109.28      35.84   2
250163              Meat      421.89     364.69   3
375040         Beverages       47.45      31.79   4
500062   Office_Supplies      651.21     524.96   5
624930         Cosmetics      437.20     263.33   6
749976            Snacks      152.58      97.44   7
875113     Personal_Care       81.73      56.67   8
1000256        Household      668.27     502.54   9
1125191       Vegetables      154.06      90.93  10
1250022        Baby_Food      255.28     159.42  11
1375094           Cereal      205.70     117.11  12

In [42]:
for i,row in itemdf.iterrows():
    sql = "INSERT INTO SalesProject.dbo.ITEMTYPE_DIMENTION(ID,ITEMNAME,UNITPRICE,UNITCOST)\
    values("+str(row.Id)+",'"+str(row.Item_Type)+"','"+str(row.Unit_Price)+"',"+str(row.Unit_Cost)+");"
    cursor.execute(sql)

IntegrityError: ('23000', "[23000] [Microsoft][ODBC SQL Server Driver][SQL Server]Violation of PRIMARY KEY constraint 'PK__ITEMTYPE__3214EC27B4C701CA'. Cannot insert duplicate key in object 'dbo.ITEMTYPE_DIMENTION'. The duplicate key value is (1). (2627) (SQLExecDirectW); [23000] [Microsoft][ODBC SQL Server Driver][SQL Server]The statement has been terminated. (3621)")

In [ ]:
sql

In [ ]:
conn.commit()

In [ ]:
sql

    Insertion of rows in location dimention

In [ ]:
for i,row in sales.iterrows():
    sales.at[i,"Region"] = row.Region.replace(" ","_")
    sales.at[i,"Country"] = row.Country.replace(" ","_")

In [ ]:
location = sales[["Region","Country"]]

In [ ]:
location['Country'].nunique()

In [ ]:
values = {'Id' :[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185],
           'Country' :['South_Africa', 'Morocco', 'Papua_New_Guinea', 'Djibouti',
       'Slovakia', 'Sri_Lanka', 'Seychelles_', 'Tanzania', 'Ghana',
       'Taiwan', 'Algeria', 'Singapore', 'Vietnam', 'Uganda', 'Zimbabwe',
       'Ethiopia', 'France', 'The_Bahamas', 'Haiti', 'Nicaragua',
       'Turkmenistan', 'United_Kingdom', 'Dominican_Republic', 'China',
       'Kuwait', 'United_Arab_Emirates', 'Estonia', 'Malaysia', 'Vanuatu',
       'India', 'Samoa_', 'Kazakhstan', 'Czech_Republic', 'Belgium',
       'Finland', 'Oman', 'Dominica', 'Serbia', 'Sao_Tome_and_Principe',
       'Brunei', 'Israel', 'Solomon_Islands', 'Togo', 'Mauritius_',
       'Canada', 'Lebanon', 'South_Korea', 'Indonesia',
       'Antigua_and_Barbuda_', 'Tunisia_', 'Thailand', 'Nepal',
       'Montenegro', 'Greece', 'Monaco', 'Albania', 'Saint_Lucia',
       'Italy', 'Switzerland', 'Netherlands', 'Sweden', 'Burundi',
       'Iceland', 'Rwanda', 'Japan', 'Romania', 'Belize', 'Egypt',
       'Tonga', 'East_Timor', 'The_Gambia', 'Mali', 'Moldova_',
       'Pakistan', 'Madagascar', 'United_States_of_America',
       'Democratic_Republic_of_the_Congo', 'New_Zealand', 'Liberia',
       'Malawi', 'Equatorial_Guinea', 'El_Salvador', 'Greenland',
       'Myanmar', 'Costa_Rica', 'Armenia', 'Somalia', 'Kenya', 'Zambia',
       'Marshall_Islands', 'Syria', 'Niger', 'Mongolia', 'Sierra_Leone',
       'Cape_Verde', 'Denmark', 'Saint_Kitts_and_Nevis_', 'Saudi_Arabia',
       'Bulgaria', 'Sudan', 'Yemen', 'Cambodia', 'Trinidad_and_Tobago',
       'Central_African_Republic', 'Latvia', 'Grenada', 'Portugal',
       'Bahrain', 'Cameroon', 'Bhutan', 'Georgia', 'Kiribati', 'Croatia',
       'Turkey', 'Iraq', 'Comoros', 'Uzbekistan', 'Tuvalu', 'Gabon',
       'Hungary', 'Jordan', 'Andorra', 'Luxembourg', 'Guinea-Bissau',
       'Bangladesh', 'Laos', 'Nigeria', 'Germany', 'Jamaica', 'Botswana',
       'Vatican_City', 'Panama', 'Namibia', 'Ireland',
       'Federated_States_of_Micronesia', 'Poland', 'Kosovo', 'Palau',
       'Angola', 'Benin', 'Mexico', 'Malta', 'Iran', 'Mauritania',
       'Saint_Vincent_and_the_Grenadines', 'Guatemala', 'Lesotho',
       'Mozambique', 'North_Korea', 'Kyrgyzstan', 'Belarus',
       'Liechtenstein', 'Burkina_Faso', 'Australia', 'Macedonia',
       'Bosnia_and_Herzegovina', 'Barbados', 'Senegal', 'Tajikistan',
       'South_Sudan', 'Cuba', 'Russia', 'Swaziland', 'Azerbaijan',
       "Cote_d'Ivoire", 'Austria', 'Chad', 'Libya', 'Norway',
       'Afghanistan', 'Lithuania', 'Eritrea', 'Cyprus', 'Maldives',
       'Slovenia', 'Guinea', 'Philippines', 'Qatar', 'Ukraine', 'Nauru',
       'Honduras', 'Republic_of_the_Congo', 'Spain', 'San_Marino', 'Fiji']}

In [ ]:
country = pd.DataFrame(data=values)

In [ ]:
result = pd.merge(location,country, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=False,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)
result.tail()

In [ ]:
countrydf = result.drop_duplicates()
countrydf

In [ ]:
for i,row in countrydf.iterrows():
    countrydf.at[i,"Country"] = row.Country.replace("'","_")

In [ ]:
countrydf

In [ ]:
for i,row in countrydf.iterrows():
    sql = "INSERT INTO SalesProject.dbo.LOCATION_DIMENTION(LOCATIONID,CONTINENT,COUNTRY)values("+str(row.Id)+",'"+str(row.Region)+"','"+str(row.Country)+"');"
    cursor.execute(sql)

In [ ]:
conn.commit()

In [ ]:
sql

    Insertion of rows in DATE_TIME_DIM table

In [ ]:
date_time = sales[['Order_Date','year','month','Day','DayofWeek','Dayofyear','Week']]
date_time

In [ ]:
date = date_time[['Order_Date']]

In [ ]:
date = date.drop_duplicates()
date

In [ ]:
import numpy as np

In [ ]:
date['id'] = np.arange(len(date))
date

In [ ]:
result = pd.merge(date,date_time, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=False,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)
result

In [ ]:
datedf =result.drop_duplicates()
datedf

In [ ]:
for i,row in result.iterrows():
    sql = "INSERT INTO SalesProject.dbo.DATE_TIME_DIM(DATEID,DAYOFWEEK_,DAYOFYEAR_,MONTH_,YEAR_,DATE_)values("+str(row.id)+","+str(row.DayofWeek)+","+str(row.Dayofyear)+","+str(row.month)+","+str(row.year)+",'"+str(row.Order_Date)+"');"
    cursor.execute(sql)

In [ ]:
conn.commit()

In [ ]:
sql

    Insertion of rows in order dimention

In [ ]:
order1 = sales[['Order_Priority','Sales_Channel']]

In [ ]:
order = sales[['Order_Priority','Sales_Channel']]

In [ ]:
order = order[['Order_Priority']]
order =order.drop_duplicates()
order

In [ ]:
order['id'] = np.arange(len(order))
order

In [ ]:
result = pd.merge(order,order1, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=False,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)
result

In [ ]:
orderdf =result.drop_duplicates()
orderdf['id'] = np.arange(len(orderdf))
orderdf

In [ ]:
orderdf['id'].unique()

In [ ]:
orderdf.count()

In [ ]:
orderdf

In [ ]:
for i,row in orderdf.iterrows():
    sql = "INSERT INTO SalesProject.dbo.ORDER_DIM(ORDERID,ORDERPRIORITY,SALESCHANNEL)values("+str(row.id)+",'"+str(row.Order_Priority)+"','"+str(row.Sales_Channel)+"');"
    cursor.execute(sql)

In [ ]:
conn.commit()

In [ ]:
sales.head()

    Insertion of rows in Sales Fact table

In [ ]:
fact = sales[['Sales_Channel','Order_Priority','Country','Item_Type','Order_Date','Total_Revenue','Total_Cost','Total_profit','Unit_Sold']]

In [ ]:
x = fact

In [ ]:
x

In [ ]:
result = pd.merge(x,countrydf, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=False,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)
result

In [ ]:
result = result.rename(columns = {"Id":"CountryId"})

    Mergerd country and renamed it

In [ ]:
x = result

In [ ]:
result = pd.merge(x,datedf, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=False,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)
result

In [ ]:
result = result.rename(columns = {"id":"DateId"})

In [ ]:
result.head()

In [ ]:
orderdf

In [ ]:
result = pd.merge(x,orderdf, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=False,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)
result

In [ ]:
result = result.rename(columns = {"id":"OrderId"})

In [ ]:
x = result

In [ ]:
result = pd.merge(x,itemdf, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=False,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)
result

In [ ]:
result = result.rename(columns = {"Id":"ItemId"})

In [ ]:
x = result

In [ ]:
x.head()

In [ ]:
x.

In [ ]:
x

In [ ]:
for i,row in x.iterrows():
    sql = "INSERT INTO SalesProject.dbo.SALES_FACT_TABLE(LOCATIONID,ITEMTYPEID,ORDERID,DATEID,TOTALREVENUE,TOTALCOST,TOTALPROFIT,UNITSOLD)values("+str(row.CountryId)+","+str(row.ItemId)+","+str(row.OrderId)+","+str(row.DateId)+","+str(row.Total_Revenue)+","+str(row.Total_Cost)+","+str(row.Total_profit)+","+str(row.Unit_Sold)+");"
    cursor.execute(sql)

In [ ]:
conn.commit()

In [ ]:
sql